In [1]:
import pandas as pd

In [4]:
s = pd.Series(['banana',42]) #숫자 글자면 오브젝트 형태로

In [5]:
s

0    banana
1        42
dtype: object

In [12]:
pd.Series(['Wes Mckinney', 'creator of pandas'],
          index=['Person','Who'],
         name='data') #,뒤 줄 바꿈 가능

Person         Wes Mckinney
Who       creator of pandas
Name: data, dtype: object

In [16]:
pd.DataFrame({'Name':['이승협','유회승'],
             'Occupation':['래퍼','보컬'],
             'Birthday':['1992-10-31','1996-02-28'],
             'Died':['2100-12-32','2102-12-32'],
             'Age':[32,28]})

  Name Occupation    Birthday        Died  Age
0  이승협         래퍼  1992-10-31  2100-12-32   32
1  유회승         보컬  1996-02-28  2102-12-32   28

In [23]:
pd.DataFrame([['이승협','유회승'],
             ['래퍼','보컬'],
             ['1992-10-31','1996-02-28'],
             ['2100-12-32','2102-12-32'],
             [32,28]])

            0           1
0         이승협         유회승
1          래퍼          보컬
2  1992-10-31  1996-02-28
3  2100-12-32  2102-12-32
4          32          28

In [24]:
pd.DataFrame([['이승협','래퍼','1992-10-31','2100-12-32',32],
             ['유회승','보컬','1996-02-28', '2102-12-32',28]],
            columns = ['Name','Occupation','Birthday','Died','Age'])

  Name Occupation    Birthday        Died  Age
0  이승협         래퍼  1992-10-31  2100-12-32   32
1  유회승         보컬  1996-02-28  2102-12-32   28

In [26]:
df = pd.read_csv('data/scientists.csv')

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [33]:
df['Age'].mean()

59.125

In [34]:
df['Age'].min()

37

In [35]:
df['Age'].max()

90

In [36]:
df['Age'].std()

18.325918413937288

In [37]:
df['Age'].var()

335.8392857142857

In [38]:
df['Age'].sum()

473

In [42]:
df.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [45]:
df['Age'][df['Age']>df['Age'].mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [46]:
age = df['Age']
age[age>age.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [47]:
age>age.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [48]:
age[[True,False,True,True,False,False,False,False]]

0    37
2    90
3    66
Name: Age, dtype: int64

In [49]:
age + age

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [51]:
age + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [52]:
age + pd.Series([100,20])

0    137.0
1     81.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [53]:
age + [100,20,1,1,1,1,1,1]

0    137
1     81
2     91
3     67
4     57
5     46
6     42
7     78
Name: Age, dtype: int64

In [58]:
rev_age = age.sort_index(ascending=False)
rev_age

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [59]:
age + rev_age

7    154
6     82
5     90
4    112
3    132
2    180
1    122
0     74
Name: Age, dtype: int64

In [61]:
age.sort_values(ascending=False)

2    90
7    77
3    66
1    61
4    56
5    45
6    41
0    37
Name: Age, dtype: int64

In [64]:
df['Age'][df['Age']>df["Age'].mean()]

SyntaxError: EOL while scanning string literal (2594874527.py, line 1)

In [65]:
df.loc[[True,False,False,False,True,True,True,False]]

                Name        Born        Died  Age          Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
4      Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5          John Snow  1813-03-15  1858-06-16   45           Physician
6        Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [74]:
born = pd.to_datetime(df['Born'], format='%Y-%m-%d')
died = pd.to_datetime(df['Died'], format='%Y-%m-%d')

In [77]:
df['Born_dt'],df['Died_dt']= born, died

In [81]:
df.head(2)

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
 5   Born_dt     8 non-null      datetime64[ns]
 6   Died_dt     8 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 576.0+ bytes

In [84]:
df['age_days'] = df['Died_dt']-df['Born_dt']
df.head(1)

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days

In [102]:
import random

In [103]:
age = df['Age']
#random.seed(42)
random.shuffle(age)

In [104]:
age

0    66
1    37
2    77
3    45
4    61
5    90
6    56
7    41
Name: Age, dtype: int64

In [105]:
df.drop(columns = 'Born')

,Name,Died,Age,Occupation,Born_dt,Died_dt,age_days
0,Rosaline Franklin,1958-04-16,66,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1937-10-16,37,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1910-08-13,77,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1934-07-04,45,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1964-04-14,61,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1858-06-16,90,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1954-06-07,56,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1855-02-23,41,Mathematician,1777-04-30,1855-02-23,28422 days

In [106]:
df

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,66,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,37,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,77,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,45,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,61,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,90,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,56,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,41,Mathematician,1777-04-30,1855-02-23,28422 days

In [107]:
df.to_pickle('df.pickle')

In [109]:
ddd = pd.read_pickle('df.pickle')

In [110]:
ddd

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,66,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,37,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,77,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,45,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,61,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,90,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,56,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,41,Mathematician,1777-04-30,1855-02-23,28422 days

In [117]:
df.to_excel('data.xlsx')

PermissionError: [Errno 13] Permission denied: 'data.xlsx'

In [115]:
import xlwt

In [121]:
!pip install xlwt

Requirement already satisfied: xlwt in c:\users\admin\anaconda3\lib\site-packages (1.3.0)

In [132]:
df.to_excel('data.xls',index=False)

C:\Users\admin\AppData\Local\Temp\ipykernel_10804\2120591488.py:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  df.to_excel('data.xls',index=False)

In [133]:
pd.read_excel('data.xls',index_col = 0)

,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days
Name,,,,,,,
Rosaline Franklin,1920-07-25,1958-04-16,66,Chemist,1920-07-25,1958-04-16,13779
William Gosset,1876-06-13,1937-10-16,37,Statistician,1876-06-13,1937-10-16,22404
Florence Nightingale,1820-05-12,1910-08-13,77,Nurse,1820-05-12,1910-08-13,32964
Marie Curie,1867-11-07,1934-07-04,45,Chemist,1867-11-07,1934-07-04,24345
Rachel Carson,1907-05-27,1964-04-14,61,Biologist,1907-05-27,1964-04-14,20777
John Snow,1813-03-15,1858-06-16,90,Physician,1813-03-15,1858-06-16,16529
Alan Turing,1912-06-23,1954-06-07,56,Computer Scientist,1912-06-23,1954-06-07,15324
Johann Gauss,1777-04-30,1855-02-23,41,Mathematician,1777-04-30,1855-02-23,28422

In [135]:
import cx_Oracle as co

In [137]:
# dsn_tns = co.makedsn('localhost','1521',service_name = 'xe')
# conn = co.connect(user=
conn = co.connect('SCOTT/TIGER@localhost:1521/xe')
pd.read_sql('select * from emp', conn)

C:\Users\admin\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    EMPNO   ENAME        JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
0    7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN      30
6    7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-04-19  3000.0     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0      30
10   7876   ADAMS      CLERK  7788.0 1987-05-23  1100.0     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950.0     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000.0     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300.0     NaN      10